<html><head></head><body>
  <div><h1 class="chapter-number" id="_idParaDest-62">
    <a id="_idTextAnchor061">
    </a>
    
     5
    
   </h1>
   <h1 id="_idParaDest-63">
    <a id="_idTextAnchor062">
    </a>
    
     In a C++ Class, Order Must There Be
    
   </h1>
   <p class="italic-heading">
    <em class="italic">
     
      When law and order
     
    </em>
    
     <em class="italic">
      
       kill creativity
      
     </em>
    
   </p>
   <p>
    
     Ordering items is essential across various domains to ensure organization, efficiency, and clarity.
    
    
     Whether in libraries or contact lists through alphabetical ordering, customer service queues or data analysis with numerical sorting, timelines or appointments by chronology, task management or emergency response prioritization, inventory or digital file categorization, competition rankings, clothing size arrangement, geographical routing in travel or mail delivery, sequential steps in manufacturing or software development, or hierarchical structuring in organizations and biological taxonomies, ordering helps streamline processes, improve accessibility, and
    
    
     
      enhance decision-making.
     
    
   </p>
   <p>
    
     By applying different criteria, such as alphabetical, numerical, chronological, priority, categorical, ranking, size, geographical, sequential, or hierarchical, ordering facilitates better management and optimal functioning in
    
    
     

     satisfy these alignment constraints, the compiler may insert padding bytes between members, and to ensure the size of the class is a multiple of the largest alignment requirement, padding may be added at the end of
    
    
     
      the class.
     
    
   </p>
   <p>
    
     Now, the class that the
    
    <a id="_idIndexMarker225">
    </a>
    
     team had initially might have looked like the following when it was set up in memory, knowing that on their architecture, the size of a double is 8
    
    
     
      bytes long:
     
    
   </p>
   <div><div><img alt="Figure 5.1 – The initial class layout" src="img/B22235_05_1.jpg"/>
     
    </div>
   </div>
   <p class="IMG---Caption" lang="en-US" xml:lang="en-US">
    
     Figure 5.1 – The initial class layout
    
   </p>
   <p>
    
     Using this alignment, the size of the class added up being 32 bytes.
    
    
     But now that Joe has have added three more
    
    <strong class="source-inline">
     
      bool
     
    </strong>
    
     s, each 1 byte long, the compiler might have organized the memory according to the
    
    
     
      following layout:
     
    
   </p>
   <div><div><img alt="Figure 5.2 – The class layout with the new members in the wrong order" src="img/B22235_05_2.jpg"/>
     
    </div>
   </div>
   <p class="IMG---Caption" lang="en-US" xml:lang="en-US">
    
     Figure 5.2 – The class layout with the new members in the wrong order
    
   </p>
   <p>
    
     So, each byte of
    
    <strong class="source-inline">
     
      bool
     
    </strong>
    
     must
    
    <a id="_idIndexMarker226">
    </a>
    
     have been padded up to 8 bytes, in order to allow the placement of the double that follows to the proper memory address.
    
    
     This made the size of the class grow to 56, because 4
    
    <strong class="source-inline">
     
      bool
     
    </strong>
    
     s padded up to 8 bytes plus 3
    
    <strong class="source-inline">
     
      double
     
    </strong>
    
     values, each of them 8 bytes, so the sum of these takes up a total of 56 bytes.
    
    
     Clang, the compiler, has a switch that allows us to inspect the memory layout of generated classes:
    
    <strong class="source-inline">
     
      -fdump-record-layouts
     
    </strong>
    
     .
    
    
     In order to put it into good use for this case, we have created a simple source file with the previous class definition and passed it down to the compiler in order to
    
    
     
      inspect it:
     
    
   </p>
   <pre class="source-code">
&gt; $ clang -cc1 -fdump-record-layouts main.cpp
*** Dumping AST Record Layout
         0 | struct Point
         0 |   _Bool active
         8 |   double x
        16 |   _Bool x_changed
        24 |   double y
        32 |   _Bool y_changed
        40 |   double z
        48 |   _Bool z_changed
           | [sizeof=56, dsize=56, align=8,
           |  nvsize=56, nvalign=8]</pre>
   <p>
    
     The preceding data clearly denotes what we suspected initially, that is, that the
    
    <strong class="source-inline">
     
      bool
     
    </strong>
    
     that was supposed to take 1 byte now officially occupies 8 (note that behind the scenes, we have created a file called
    
    <strong class="source-inline">
     
      main.cpp
     
    </strong>
    
     with the content of the
    
    
     <strong class="source-inline">
      
       point
      
     </strong>
    
    
     
      structure).
     
    
   </p>
   <p>
    
     Now, in order to straighten out this unfortunate situation, we clearly need to take some further actions, so let’s consider the reorganization of the members
    
    <a id="_idIndexMarker227">
    </a>
    
     of the class in the
    
    
     
      following manner:
     
    
   </p>
   <pre class="source-code">
class point {
   bool active;
   bool x_changed;
   bool y_changed;
   bool z_changed;
   double y;
   double x;
   double z;
};</pre>
   <p>
    
     It is not a huge change, besides hurting Joe’s feelings that the members are not organized alphabetically.
    
    
     We have grouped together the
    
    <strong class="source-inline">
     
      bool
     
    </strong>
    
     values so the class is as compact
    
    
     
      as possible.
     
    
   </p>
   <p>
    
     We have used the preceding information, especially taking into consideration the size requirements of each of the types, and concluded that it is always better to have small types grouped together (by
    
    <em class="italic">
     
      small types
     
    </em>
    
     , we mean variables whose type will take up the smallest number of bytes; for example, we know that the size of a
    
    <strong class="source-inline">
     
      bool
     
    </strong>
    
     variable is 1, at least for the implementation we
    
    
     
      are using).
     
    
   </p>
   <p>
    
     By doing this, that is, by reorganizing the order in which the members are presented, we have created the following memory layout (or something similar but more optimal for
    
    
     
      our architecture):
     
    
   </p>
   <div><div><img alt="Figure 5.3 – The class layout with the members in the proper order" src="img/B22235_05_3.jpg"/>
     
    </div>
   </div>
   <p class="IMG---Caption" lang="en-US" xml:lang="en-US">
    
     Figure 5.3 – The class layout with the members in the proper order
    
   </p>
   <p>
    
     Indeed, after checking with
    
    <a id="_idIndexMarker228">
    </a>
    
     Clang again, the memory of the class looks very different from the previous version (please again ignore the fact that behind the scenes, we have modified our
    
    <strong class="source-inline">
     
      main.cpp
     
    </strong>
    
     to contain the
    
    
     
      preceding structure):
     
    
   </p>
   <pre class="source-code">
&gt; $ clang -cc1 -fdump-record-layouts main.cpp
*** Dumping AST Record Layout
         0 | struct Point
         0 |   _Bool active
         1 |   _Bool x_changed
         2 |   _Bool y_changed
         3 |   _Bool z_changed
         8 |   double x
        16 |   double y
        24 |   double z
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]</pre>
   <p>
    
     So, as we can see now, the four
    
    <strong class="source-inline">
     
      bool
     
    </strong>
    
     values are placed in memory one after the other, and there is only one section of padding required to fill up the required space, for the
    
    <strong class="source-inline">
     
      double
     
    </strong>
    
     values to be aligned on the required memory addresses.
    
    
     Hypothetically, if we were to have a field with a size of
    
    <strong class="source-inline">
     
      4
     
    </strong>
    
     , we could nicely fit it after the last
    
    <strong class="source-inline">
     
      bool
     
    </strong>
    
     , before the first
    
    <strong class="source-inline">
     
      double
     
    </strong>
    
     , and we would not need any
    
    
     
      padding either.
     
    
   </p>
   <p>
    
